---
type: VisibleInViewFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# VisibleInViewFilter

`Autodesk.Revit.DB.VisibleInViewFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VisibleInViewFilter | — | `` |
| Method | PassesFilter | — | `` |